### 🚀 Terraform Apply Result
<details><summary>Click to view full apply logs</summary>

```
[command]/home/runner/work/_temp/59761076-c62a-44bc-8536-97851323a216/terraform-bin -chdir=terraform_infra apply -auto-approve

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_db_instance.mydb[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "mydb" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = (known after apply)
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = (known after apply)
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = "mydb"
      [32m+[0m[0m db_subnet_group_name                  = "rds-subnet-group-demo11"
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "mysql"
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "8.0"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = (known after apply)
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = (known after apply)
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = (known after apply)
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = (known after apply)
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = (known after apply)
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m region                                = "us-east-1"
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags_all                              = (known after apply)
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = "admin"
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # aws_db_subnet_group.rds_subnet[0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "rds_subnet" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "Managed by Terraform"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = "rds-subnet-group-demo11"
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m region                  = "us-east-1"
      [32m+[0m[0m subnet_ids              = (known after apply)
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Name" = "rds-subnet-group-demo"
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Name" = "rds-subnet-group-demo"
        }
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1m  # aws_iam_instance_profile.ec2_profile[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ec2_profile" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "ec2-instance-profile-demo11"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "ec2-s3-role-demo1"
      [32m+[0m[0m tags_all    = (known after apply)
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # aws_iam_policy_attachment.ec2_s3_attach[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy_attachment" "ec2_s3_attach" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m name       = "ec2-s3-attach-demo"
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      [32m+[0m[0m roles      = [
          [32m+[0m[0m "ec2-s3-role-demo1",
        ]
    }

[1m  # aws_iam_role.ec2_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ec2_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "ec2-s3-role-demo1"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_instance.demo[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "demo" {
      [32m+[0m[0m ami                                  = "ami-08982f1c5bf93d976"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)
      [32m+[0m[0m force_destroy                        = false
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "ec2-instance-profile-demo11"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "deployer_new"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_group_id                   = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m region                               = "us-east-1"
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "Tf-Demo-EC2"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "Tf-Demo-EC2"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)
    }

[1m  # aws_internet_gateway.demo_igw[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "demo_igw" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m region   = "us-east-1"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Name" = "demo-igw"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Name" = "demo-igw"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # aws_route_table.demo_public_rt[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "demo_public_rt" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m region           = "us-east-1"
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m carrier_gateway_id         = ""
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m core_network_arn           = ""
              [32m+[0m[0m destination_prefix_list_id = ""
              [32m+[0m[0m egress_only_gateway_id     = ""
              [32m+[0m[0m gateway_id                 = (known after apply)
              [32m+[0m[0m ipv6_cidr_block            = ""
              [32m+[0m[0m local_gateway_id           = ""
              [32m+[0m[0m nat_gateway_id             = ""
              [32m+[0m[0m network_interface_id       = ""
              [32m+[0m[0m transit_gateway_id         = ""
              [32m+[0m[0m vpc_endpoint_id            = ""
              [32m+[0m[0m vpc_peering_connection_id  = ""
            },
        ]
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "demo-public-rt"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name" = "demo-public-rt"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # aws_route_table_association.demo_public_assoc[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "demo_public_assoc" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m region         = "us-east-1"
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_security_group.ec2_sg[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "ec2_sg" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Allow SSH, HTTP, HTTPS, Frontend, Backend"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Backend app"
              [32m+[0m[0m from_port        = 8080
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 8080
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Frontend app"
              [32m+[0m[0m from_port        = 5000
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 5000
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Grafana"
              [32m+[0m[0m from_port        = 3000
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 3000
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "HTTP"
              [32m+[0m[0m from_port        = 80
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 80
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "HTTPS"
              [32m+[0m[0m from_port        = 443
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 443
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Node exporter"
              [32m+[0m[0m from_port        = 9100
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 9100
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Prometheus"
              [32m+[0m[0m from_port        = 9090
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 9090
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "SSH"
              [32m+[0m[0m from_port        = 22
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 22
            },
        ]
      [32m+[0m[0m name                   = "ec2-sg-demo"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m region                 = "us-east-1"
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # aws_subnet.demo_private_subnet_a[0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "demo_private_subnet_a" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m region                                         = "us-east-1"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "demo-private-subnet-a"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "demo-private-subnet-a"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.demo_private_subnet_b[0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "demo_private_subnet_b" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.3.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m region                                         = "us-east-1"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "demo-private-subnet-b"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "demo-private-subnet-b"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.demo_public_subnet[0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "demo_public_subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m region                                         = "us-east-1"
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "demo-public-subnet"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "demo-public-subnet"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_vpc.demo_vpc[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "demo_vpc" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m region                               = "us-east-1"
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "demo-vpc"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "demo-vpc"
        }
    }

[1mPlan:[0m 14 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m ec2_public_ip = (known after apply)
  [32m+[0m[0m rds_endpoint  = (known after apply)
[0m[1maws_iam_role.ec2_role: Creating...[0m[0m
[0m[1maws_vpc.demo_vpc: Creating...[0m[0m
[0m[1maws_iam_role.ec2_role: Creation complete after 0s [id=ec2-s3-role-demo1][0m
[0m[1maws_iam_policy_attachment.ec2_s3_attach: Creating...[0m[0m
[0m[1maws_iam_instance_profile.ec2_profile: Creating...[0m[0m
[0m[1maws_iam_policy_attachment.ec2_s3_attach: Creation complete after 1s [id=ec2-s3-attach-demo][0m
[0m[1maws_iam_instance_profile.ec2_profile: Creation complete after 7s [id=ec2-instance-profile-demo11][0m
[0m[1maws_vpc.demo_vpc: Still creating... [10s elapsed][0m[0m
[0m[1maws_vpc.demo_vpc: Creation complete after 12s [id=vpc-0bd3a1d1e894cb5a0][0m
[0m[1maws_subnet.demo_private_subnet_a: Creating...[0m[0m
[0m[1maws_subnet.demo_public_subnet: Creating...[0m[0m
[0m[1maws_internet_gateway.demo_igw: Creating...[0m[0m
[0m[1maws_subnet.demo_private_subnet_b: Creating...[0m[0m
[0m[1maws_security_group.ec2_sg: Creating...[0m[0m
[0m[1maws_subnet.demo_private_subnet_a: Creation complete after 1s [id=subnet-0634f444a651d84d5][0m
[0m[1maws_internet_gateway.demo_igw: Creation complete after 1s [id=igw-002a8ba25e53425b9][0m
[0m[1maws_route_table.demo_public_rt: Creating...[0m[0m
[0m[1maws_subnet.demo_private_subnet_b: Creation complete after 1s [id=subnet-06abf5eb7b8768338][0m
[0m[1maws_db_subnet_group.rds_subnet: Creating...[0m[0m
[0m[1maws_route_table.demo_public_rt: Creation complete after 1s [id=rtb-0b29a7066f4e5195f][0m
[0m[1maws_db_subnet_group.rds_subnet: Creation complete after 1s [id=rds-subnet-group-demo11][0m
[0m[1maws_security_group.ec2_sg: Creation complete after 2s [id=sg-0ad058ba073effe4f][0m
[0m[1maws_db_instance.mydb: Creating...[0m[0m
[0m[1maws_subnet.demo_public_subnet: Still creating... [10s elapsed][0m[0m
[0m[1maws_subnet.demo_public_subnet: Creation complete after 11s [id=subnet-0a9e1f4f2df741c6b][0m
[0m[1maws_route_table_association.demo_public_assoc: Creating...[0m[0m
[0m[1maws_instance.demo: Creating...[0m[0m
[0m[1maws_route_table_association.demo_public_assoc: Creation complete after 0s [id=rtbassoc-07599a7a4ae343593][0m
[0m[1maws_db_instance.mydb: Still creating... [10s elapsed][0m[0m
[0m[1maws_instance.demo: Still creating... [10s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [20s elapsed][0m[0m
[0m[1maws_instance.demo: Creation complete after 13s [id=i-0c4a97116a9e87707][0m
[0m[1maws_db_instance.mydb: Still creating... [30s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [40s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [50s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [1m0s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [1m10s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [1m20s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [1m30s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [1m40s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [1m50s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [2m0s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [2m10s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [2m20s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [2m30s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [2m40s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [2m50s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [3m0s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [3m10s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [3m20s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [3m30s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [3m40s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [3m50s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [4m0s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [4m10s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [4m20s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Still creating... [4m30s elapsed][0m[0m
[0m[1maws_db_instance.mydb: Creation complete after 4m36s [id=db-PJ5FP3WUQ4O7R5244YZ2SHHMQI][0m
[0m[1m[32m
Apply complete! Resources: 14 added, 0 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mec2_public_ip = "34.207.130.138"
rds_endpoint = "terraform-20251029160941414900000002.cql66w04espj.us-east-1.rds.amazonaws.com:3306"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_db_instance.mydb[0m will be created%0A[0m  [32m+[0m[0m resource "aws_db_instance" "mydb" {%0A      [32m+[0m[0m address                               = (known after apply)%0A      [32m+[0m[0m allocated_storage                     = 20%0A      [32m+[0m[0m apply_immediately                     = false%0A      [32m+[0m[0m arn                                   = (known after apply)%0A      [32m+[0m[0m auto_minor_version_upgrade            = true%0A      [32m+[0m[0m availability_zone                     = (known after apply)%0A      [32m+[0m[0m backup_retention_period               = (known after apply)%0A      [32m+[0m[0m backup_target                         = (known after apply)%0A      [32m+[0m[0m backup_window                         = (known after apply)%0A      [32m+[0m[0m ca_cert_identifier                    = (known after apply)%0A      [32m+[0m[0m character_set_name                    = (known after apply)%0A      [32m+[0m[0m copy_tags_to_snapshot                 = false%0A      [32m+[0m[0m database_insights_mode                = (known after apply)%0A      [32m+[0m[0m db_name                               = "mydb"%0A      [32m+[0m[0m db_subnet_group_name                  = "rds-subnet-group-demo11"%0A      [32m+[0m[0m dedicated_log_volume                  = false%0A      [32m+[0m[0m delete_automated_backups              = true%0A      [32m+[0m[0m domain_fqdn                           = (known after apply)%0A      [32m+[0m[0m endpoint                              = (known after apply)%0A      [32m+[0m[0m engine                                = "mysql"%0A      [32m+[0m[0m engine_lifecycle_support              = (known after apply)%0A      [32m+[0m[0m engine_version                        = "8.0"%0A      [32m+[0m[0m engine_version_actual                 = (known after apply)%0A      [32m+[0m[0m hosted_zone_id                        = (known after apply)%0A      [32m+[0m[0m id                                    = (known after apply)%0A      [32m+[0m[0m identifier                            = (known after apply)%0A      [32m+[0m[0m identifier_prefix                     = (known after apply)%0A      [32m+[0m[0m instance_class                        = "db.t3.micro"%0A      [32m+[0m[0m iops                                  = (known after apply)%0A      [32m+[0m[0m kms_key_id                            = (known after apply)%0A      [32m+[0m[0m latest_restorable_time                = (known after apply)%0A      [32m+[0m[0m license_model                         = (known after apply)%0A      [32m+[0m[0m listener_endpoint                     = (known after apply)%0A      [32m+[0m[0m maintenance_window                    = (known after apply)%0A      [32m+[0m[0m master_user_secret                    = (known after apply)%0A      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)%0A      [32m+[0m[0m monitoring_interval                   = 0%0A      [32m+[0m[0m monitoring_role_arn                   = (known after apply)%0A      [32m+[0m[0m multi_az                              = (known after apply)%0A      [32m+[0m[0m nchar_character_set_name              = (known after apply)%0A      [32m+[0m[0m network_type                          = (known after apply)%0A      [32m+[0m[0m option_group_name                     = (known after apply)%0A      [32m+[0m[0m parameter_group_name                  = (known after apply)%0A      [32m+[0m[0m password                              = (sensitive value)%0A      [32m+[0m[0m performance_insights_enabled          = false%0A      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)%0A      [32m+[0m[0m performance_insights_retention_period = (known after apply)%0A      [32m+[0m[0m port                                  = (known after apply)%0A      [32m+[0m[0m publicly_accessible                   = false%0A      [32m+[0m[0m region                                = "us-east-1"%0A      [32m+[0m[0m replica_mode                          = (known after apply)%0A      [32m+[0m[0m replicas                              = (known after apply)%0A      [32m+[0m[0m resource_id                           = (known after apply)%0A      [32m+[0m[0m skip_final_snapshot                   = true%0A      [32m+[0m[0m snapshot_identifier                   = (known after apply)%0A      [32m+[0m[0m status                                = (known after apply)%0A      [32m+[0m[0m storage_throughput                    = (known after apply)%0A      [32m+[0m[0m storage_type                          = (known after apply)%0A      [32m+[0m[0m tags_all                              = (known after apply)%0A      [32m+[0m[0m timezone                              = (known after apply)%0A      [32m+[0m[0m username                              = "admin"%0A      [32m+[0m[0m vpc_security_group_ids                = (known after apply)%0A    }%0A%0A[1m  # aws_db_subnet_group.rds_subnet[0m will be created%0A[0m  [32m+[0m[0m resource "aws_db_subnet_group" "rds_subnet" {%0A      [32m+[0m[0m arn                     = (known after apply)%0A      [32m+[0m[0m description             = "Managed by Terraform"%0A      [32m+[0m[0m id                      = (known after apply)%0A      [32m+[0m[0m name                    = "rds-subnet-group-demo11"%0A      [32m+[0m[0m name_prefix             = (known after apply)%0A      [32m+[0m[0m region                  = "us-east-1"%0A      [32m+[0m[0m subnet_ids              = (known after apply)%0A      [32m+[0m[0m supported_network_types = (known after apply)%0A      [32m+[0m[0m tags                    = {%0A          [32m+[0m[0m "Name" = "rds-subnet-group-demo"%0A        }%0A      [32m+[0m[0m tags_all                = {%0A          [32m+[0m[0m "Name" = "rds-subnet-group-demo"%0A        }%0A      [32m+[0m[0m vpc_id                  = (known after apply)%0A    }%0A%0A[1m  # aws_iam_instance_profile.ec2_profile[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ec2_profile" {%0A      [32m+[0m[0m arn         = (known after apply)%0A      [32m+[0m[0m create_date = (known after apply)%0A      [32m+[0m[0m id          = (known after apply)%0A      [32m+[0m[0m name        = "ec2-instance-profile-demo11"%0A      [32m+[0m[0m name_prefix = (known after apply)%0A      [32m+[0m[0m path        = "/"%0A      [32m+[0m[0m role        = "ec2-s3-role-demo1"%0A      [32m+[0m[0m tags_all    = (known after apply)%0A      [32m+[0m[0m unique_id   = (known after apply)%0A    }%0A%0A[1m  # aws_iam_policy_attachment.ec2_s3_attach[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_policy_attachment" "ec2_s3_attach" {%0A      [32m+[0m[0m id         = (known after apply)%0A      [32m+[0m[0m name       = "ec2-s3-attach-demo"%0A      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"%0A      [32m+[0m[0m roles      = [%0A          [32m+[0m[0m "ec2-s3-role-demo1",%0A        ]%0A    }%0A%0A[1m  # aws_iam_role.ec2_role[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role" "ec2_role" {%0A      [32m+[0m[0m arn                   = (known after apply)%0A      [32m+[0m[0m assume_role_policy    = jsonencode(%0A            {%0A              [32m+[0m[0m Statement = [%0A                  [32m+[0m[0m {%0A                      [32m+[0m[0m Action    = "sts:AssumeRole"%0A                      [32m+[0m[0m Effect    = "Allow"%0A                      [32m+[0m[0m Principal = {%0A                          [32m+[0m[0m Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              [32m+[0m[0m Version   = "2012-10-17"%0A            }%0A        )%0A      [32m+[0m[0m create_date           = (known after apply)%0A      [32m+[0m[0m force_detach_policies = false%0A      [32m+[0m[0m id                    = (known after apply)%0A      [32m+[0m[0m managed_policy_arns   = (known after apply)%0A      [32m+[0m[0m max_session_duration  = 3600%0A      [32m+[0m[0m name                  = "ec2-s3-role-demo1"%0A      [32m+[0m[0m name_prefix           = (known after apply)%0A      [32m+[0m[0m path                  = "/"%0A      [32m+[0m[0m tags_all              = (known after apply)%0A      [32m+[0m[0m unique_id             = (known after apply)%0A    }%0A%0A[1m  # aws_instance.demo[0m will be created%0A[0m  [32m+[0m[0m resource "aws_instance" "demo" {%0A      [32m+[0m[0m ami                                  = "ami-08982f1c5bf93d976"%0A      [32m+[0m[0m arn                                  = (known after apply)%0A      [32m+[0m[0m associate_public_ip_address          = true%0A      [32m+[0m[0m availability_zone                    = (known after apply)%0A      [32m+[0m[0m disable_api_stop                     = (known after apply)%0A      [32m+[0m[0m disable_api_termination              = (known after apply)%0A      [32m+[0m[0m ebs_optimized                        = (known after apply)%0A      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)%0A      [32m+[0m[0m force_destroy                        = false%0A      [32m+[0m[0m get_password_data                    = false%0A      [32m+[0m[0m host_id                              = (known after apply)%0A      [32m+[0m[0m host_resource_group_arn              = (known after apply)%0A      [32m+[0m[0m iam_instance_profile                 = "ec2-instance-profile-demo11"%0A      [32m+[0m[0m id                                   = (known after apply)%0A      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)%0A      [32m+[0m[0m instance_lifecycle                   = (known after apply)%0A      [32m+[0m[0m instance_state                       = (known after apply)%0A      [32m+[0m[0m instance_type                        = "t3.micro"%0A      [32m+[0m[0m ipv6_address_count                   = (known after apply)%0A      [32m+[0m[0m ipv6_addresses                       = (known after apply)%0A      [32m+[0m[0m key_name                             = "deployer_new"%0A      [32m+[0m[0m monitoring                           = (known after apply)%0A      [32m+[0m[0m outpost_arn                          = (known after apply)%0A      [32m+[0m[0m password_data                        = (known after apply)%0A      [32m+[0m[0m placement_group                      = (known after apply)%0A      [32m+[0m[0m placement_group_id                   = (known after apply)%0A      [32m+[0m[0m placement_partition_number           = (known after apply)%0A      [32m+[0m[0m primary_network_interface_id         = (known after apply)%0A      [32m+[0m[0m private_dns                          = (known after apply)%0A      [32m+[0m[0m private_ip                           = (known after apply)%0A      [32m+[0m[0m public_dns                           = (known after apply)%0A      [32m+[0m[0m public_ip                            = (known after apply)%0A      [32m+[0m[0m region                               = "us-east-1"%0A      [32m+[0m[0m secondary_private_ips                = (known after apply)%0A      [32m+[0m[0m security_groups                      = (known after apply)%0A      [32m+[0m[0m source_dest_check                    = true%0A      [32m+[0m[0m spot_instance_request_id             = (known after apply)%0A      [32m+[0m[0m subnet_id                            = (known after apply)%0A      [32m+[0m[0m tags                                 = {%0A          [32m+[0m[0m "Name" = "Tf-Demo-EC2"%0A        }%0A      [32m+[0m[0m tags_all                             = {%0A          [32m+[0m[0m "Name" = "Tf-Demo-EC2"%0A        }%0A      [32m+[0m[0m tenancy                              = (known after apply)%0A      [32m+[0m[0m user_data_base64                     = (known after apply)%0A      [32m+[0m[0m user_data_replace_on_change          = false%0A      [32m+[0m[0m vpc_security_group_ids               = (known after apply)%0A    }%0A%0A[1m  # aws_internet_gateway.demo_igw[0m will be created%0A[0m  [32m+[0m[0m resource "aws_internet_gateway" "demo_igw" {%0A      [32m+[0m[0m arn      = (known after apply)%0A      [32m+[0m[0m id       = (known after apply)%0A      [32m+[0m[0m owner_id = (known after apply)%0A      [32m+[0m[0m region   = "us-east-1"%0A      [32m+[0m[0m tags     = {%0A          [32m+[0m[0m "Name" = "demo-igw"%0A        }%0A      [32m+[0m[0m tags_all = {%0A          [32m+[0m[0m "Name" = "demo-igw"%0A        }%0A      [32m+[0m[0m vpc_id   = (known after apply)%0A    }%0A%0A[1m  # aws_route_table.demo_public_rt[0m will be created%0A[0m  [32m+[0m[0m resource "aws_route_table" "demo_public_rt" {%0A      [32m+[0m[0m arn              = (known after apply)%0A      [32m+[0m[0m id               = (known after apply)%0A      [32m+[0m[0m owner_id         = (known after apply)%0A      [32m+[0m[0m propagating_vgws = (known after apply)%0A      [32m+[0m[0m region           = "us-east-1"%0A      [32m+[0m[0m route            = [%0A          [32m+[0m[0m {%0A              [32m+[0m[0m carrier_gateway_id         = ""%0A              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"%0A              [32m+[0m[0m core_network_arn           = ""%0A              [32m+[0m[0m destination_prefix_list_id = ""%0A              [32m+[0m[0m egress_only_gateway_id     = ""%0A              [32m+[0m[0m gateway_id                 = (known after apply)%0A              [32m+[0m[0m ipv6_cidr_block            = ""%0A              [32m+[0m[0m local_gateway_id           = ""%0A              [32m+[0m[0m nat_gateway_id             = ""%0A              [32m+[0m[0m network_interface_id       = ""%0A              [32m+[0m[0m transit_gateway_id         = ""%0A              [32m+[0m[0m vpc_endpoint_id            = ""%0A              [32m+[0m[0m vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      [32m+[0m[0m tags             = {%0A          [32m+[0m[0m "Name" = "demo-public-rt"%0A        }%0A      [32m+[0m[0m tags_all         = {%0A          [32m+[0m[0m "Name" = "demo-public-rt"%0A        }%0A      [32m+[0m[0m vpc_id           = (known after apply)%0A    }%0A%0A[1m  # aws_route_table_association.demo_public_assoc[0m will be created%0A[0m  [32m+[0m[0m resource "aws_route_table_association" "demo_public_assoc" {%0A      [32m+[0m[0m id             = (known after apply)%0A      [32m+[0m[0m region         = "us-east-1"%0A      [32m+[0m[0m route_table_id = (known after apply)%0A      [32m+[0m[0m subnet_id      = (known after apply)%0A    }%0A%0A[1m  # aws_security_group.ec2_sg[0m will be created%0A[0m  [32m+[0m[0m resource "aws_security_group" "ec2_sg" {%0A      [32m+[0m[0m arn                    = (known after apply)%0A      [32m+[0m[0m description            = "Allow SSH, HTTP, HTTPS, Frontend, Backend"%0A      [32m+[0m[0m egress                 = [%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = ""%0A              [32m+[0m[0m from_port        = 0%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "-1"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 0%0A            },%0A        ]%0A      [32m+[0m[0m id                     = (known after apply)%0A      [32m+[0m[0m ingress                = [%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "Backend app"%0A              [32m+[0m[0m from_port        = 8080%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 8080%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "Frontend app"%0A              [32m+[0m[0m from_port        = 5000%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 5000%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "Grafana"%0A              [32m+[0m[0m from_port        = 3000%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 3000%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "HTTP"%0A              [32m+[0m[0m from_port        = 80%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 80%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "HTTPS"%0A              [32m+[0m[0m from_port        = 443%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 443%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "Node exporter"%0A              [32m+[0m[0m from_port        = 9100%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 9100%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "Prometheus"%0A              [32m+[0m[0m from_port        = 9090%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 9090%0A            },%0A          [32m+[0m[0m {%0A              [32m+[0m[0m cidr_blocks      = [%0A                  [32m+[0m[0m "0.0.0.0/0",%0A                ]%0A              [32m+[0m[0m description      = "SSH"%0A              [32m+[0m[0m from_port        = 22%0A              [32m+[0m[0m ipv6_cidr_blocks = []%0A              [32m+[0m[0m prefix_list_ids  = []%0A              [32m+[0m[0m protocol         = "tcp"%0A              [32m+[0m[0m security_groups  = []%0A              [32m+[0m[0m self             = false%0A              [32m+[0m[0m to_port          = 22%0A            },%0A        ]%0A      [32m+[0m[0m name                   = "ec2-sg-demo"%0A      [32m+[0m[0m name_prefix            = (known after apply)%0A      [32m+[0m[0m owner_id               = (known after apply)%0A      [32m+[0m[0m region                 = "us-east-1"%0A      [32m+[0m[0m revoke_rules_on_delete = false%0A      [32m+[0m[0m tags_all               = (known after apply)%0A      [32m+[0m[0m vpc_id                 = (known after apply)%0A    }%0A%0A[1m  # aws_subnet.demo_private_subnet_a[0m will be created%0A[0m  [32m+[0m[0m resource "aws_subnet" "demo_private_subnet_a" {%0A      [32m+[0m[0m arn                                            = (known after apply)%0A      [32m+[0m[0m assign_ipv6_address_on_creation                = false%0A      [32m+[0m[0m availability_zone                              = "us-east-1a"%0A      [32m+[0m[0m availability_zone_id                           = (known after apply)%0A      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"%0A      [32m+[0m[0m enable_dns64                                   = false%0A      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false%0A      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false%0A      [32m+[0m[0m id                                             = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)%0A      [32m+[0m[0m ipv6_native                                    = false%0A      [32m+[0m[0m map_public_ip_on_launch                        = false%0A      [32m+[0m[0m owner_id                                       = (known after apply)%0A      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)%0A      [32m+[0m[0m region                                         = "us-east-1"%0A      [32m+[0m[0m tags                                           = {%0A          [32m+[0m[0m "Name" = "demo-private-subnet-a"%0A        }%0A      [32m+[0m[0m tags_all                                       = {%0A          [32m+[0m[0m "Name" = "demo-private-subnet-a"%0A        }%0A      [32m+[0m[0m vpc_id                                         = (known after apply)%0A    }%0A%0A[1m  # aws_subnet.demo_private_subnet_b[0m will be created%0A[0m  [32m+[0m[0m resource "aws_subnet" "demo_private_subnet_b" {%0A      [32m+[0m[0m arn                                            = (known after apply)%0A      [32m+[0m[0m assign_ipv6_address_on_creation                = false%0A      [32m+[0m[0m availability_zone                              = "us-east-1b"%0A      [32m+[0m[0m availability_zone_id                           = (known after apply)%0A      [32m+[0m[0m cidr_block                                     = "10.0.3.0/24"%0A      [32m+[0m[0m enable_dns64                                   = false%0A      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false%0A      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false%0A      [32m+[0m[0m id                                             = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)%0A      [32m+[0m[0m ipv6_native                                    = false%0A      [32m+[0m[0m map_public_ip_on_launch                        = false%0A      [32m+[0m[0m owner_id                                       = (known after apply)%0A      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)%0A      [32m+[0m[0m region                                         = "us-east-1"%0A      [32m+[0m[0m tags                                           = {%0A          [32m+[0m[0m "Name" = "demo-private-subnet-b"%0A        }%0A      [32m+[0m[0m tags_all                                       = {%0A          [32m+[0m[0m "Name" = "demo-private-subnet-b"%0A        }%0A      [32m+[0m[0m vpc_id                                         = (known after apply)%0A    }%0A%0A[1m  # aws_subnet.demo_public_subnet[0m will be created%0A[0m  [32m+[0m[0m resource "aws_subnet" "demo_public_subnet" {%0A      [32m+[0m[0m arn                                            = (known after apply)%0A      [32m+[0m[0m assign_ipv6_address_on_creation                = false%0A      [32m+[0m[0m availability_zone                              = "us-east-1a"%0A      [32m+[0m[0m availability_zone_id                           = (known after apply)%0A      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"%0A      [32m+[0m[0m enable_dns64                                   = false%0A      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false%0A      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false%0A      [32m+[0m[0m id                                             = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)%0A      [32m+[0m[0m ipv6_native                                    = false%0A      [32m+[0m[0m map_public_ip_on_launch                        = true%0A      [32m+[0m[0m owner_id                                       = (known after apply)%0A      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)%0A      [32m+[0m[0m region                                         = "us-east-1"%0A      [32m+[0m[0m tags                                           = {%0A          [32m+[0m[0m "Name" = "demo-public-subnet"%0A        }%0A      [32m+[0m[0m tags_all                                       = {%0A          [32m+[0m[0m "Name" = "demo-public-subnet"%0A        }%0A      [32m+[0m[0m vpc_id                                         = (known after apply)%0A    }%0A%0A[1m  # aws_vpc.demo_vpc[0m will be created%0A[0m  [32m+[0m[0m resource "aws_vpc" "demo_vpc" {%0A      [32m+[0m[0m arn                                  = (known after apply)%0A      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"%0A      [32m+[0m[0m default_network_acl_id               = (known after apply)%0A      [32m+[0m[0m default_route_table_id               = (known after apply)%0A      [32m+[0m[0m default_security_group_id            = (known after apply)%0A      [32m+[0m[0m dhcp_options_id                      = (known after apply)%0A      [32m+[0m[0m enable_dns_hostnames                 = true%0A      [32m+[0m[0m enable_dns_support                   = true%0A      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)%0A      [32m+[0m[0m id                                   = (known after apply)%0A      [32m+[0m[0m instance_tenancy                     = "default"%0A      [32m+[0m[0m ipv6_association_id                  = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)%0A      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)%0A      [32m+[0m[0m main_route_table_id                  = (known after apply)%0A      [32m+[0m[0m owner_id                             = (known after apply)%0A      [32m+[0m[0m region                               = "us-east-1"%0A      [32m+[0m[0m tags                                 = {%0A          [32m+[0m[0m "Name" = "demo-vpc"%0A        }%0A      [32m+[0m[0m tags_all                             = {%0A          [32m+[0m[0m "Name" = "demo-vpc"%0A        }%0A    }%0A%0A[1mPlan:[0m 14 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m ec2_public_ip = (known after apply)%0A  [32m+[0m[0m rds_endpoint  = (known after apply)%0A[0m[1maws_iam_role.ec2_role: Creating...[0m[0m%0A[0m[1maws_vpc.demo_vpc: Creating...[0m[0m%0A[0m[1maws_iam_role.ec2_role: Creation complete after 0s [id=ec2-s3-role-demo1][0m%0A[0m[1maws_iam_policy_attachment.ec2_s3_attach: Creating...[0m[0m%0A[0m[1maws_iam_instance_profile.ec2_profile: Creating...[0m[0m%0A[0m[1maws_iam_policy_attachment.ec2_s3_attach: Creation complete after 1s [id=ec2-s3-attach-demo][0m%0A[0m[1maws_iam_instance_profile.ec2_profile: Creation complete after 7s [id=ec2-instance-profile-demo11][0m%0A[0m[1maws_vpc.demo_vpc: Still creating... [10s elapsed][0m[0m%0A[0m[1maws_vpc.demo_vpc: Creation complete after 12s [id=vpc-0bd3a1d1e894cb5a0][0m%0A[0m[1maws_subnet.demo_private_subnet_a: Creating...[0m[0m%0A[0m[1maws_subnet.demo_public_subnet: Creating...[0m[0m%0A[0m[1maws_internet_gateway.demo_igw: Creating...[0m[0m%0A[0m[1maws_subnet.demo_private_subnet_b: Creating...[0m[0m%0A[0m[1maws_security_group.ec2_sg: Creating...[0m[0m%0A[0m[1maws_subnet.demo_private_subnet_a: Creation complete after 1s [id=subnet-0634f444a651d84d5][0m%0A[0m[1maws_internet_gateway.demo_igw: Creation complete after 1s [id=igw-002a8ba25e53425b9][0m%0A[0m[1maws_route_table.demo_public_rt: Creating...[0m[0m%0A[0m[1maws_subnet.demo_private_subnet_b: Creation complete after 1s [id=subnet-06abf5eb7b8768338][0m%0A[0m[1maws_db_subnet_group.rds_subnet: Creating...[0m[0m%0A[0m[1maws_route_table.demo_public_rt: Creation complete after 1s [id=rtb-0b29a7066f4e5195f][0m%0A[0m[1maws_db_subnet_group.rds_subnet: Creation complete after 1s [id=rds-subnet-group-demo11][0m%0A[0m[1maws_security_group.ec2_sg: Creation complete after 2s [id=sg-0ad058ba073effe4f][0m%0A[0m[1maws_db_instance.mydb: Creating...[0m[0m%0A[0m[1maws_subnet.demo_public_subnet: Still creating... [10s elapsed][0m[0m%0A[0m[1maws_subnet.demo_public_subnet: Creation complete after 11s [id=subnet-0a9e1f4f2df741c6b][0m%0A[0m[1maws_route_table_association.demo_public_assoc: Creating...[0m[0m%0A[0m[1maws_instance.demo: Creating...[0m[0m%0A[0m[1maws_route_table_association.demo_public_assoc: Creation complete after 0s [id=rtbassoc-07599a7a4ae343593][0m%0A[0m[1maws_db_instance.mydb: Still creating... [10s elapsed][0m[0m%0A[0m[1maws_instance.demo: Still creating... [10s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [20s elapsed][0m[0m%0A[0m[1maws_instance.demo: Creation complete after 13s [id=i-0c4a97116a9e87707][0m%0A[0m[1maws_db_instance.mydb: Still creating... [30s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [40s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [50s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [1m0s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [1m10s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [1m20s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [1m30s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [1m40s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [1m50s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [2m0s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [2m10s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [2m20s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [2m30s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [2m40s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [2m50s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [3m0s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [3m10s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [3m20s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [3m30s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [3m40s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [3m50s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [4m0s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [4m10s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [4m20s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Still creating... [4m30s elapsed][0m[0m%0A[0m[1maws_db_instance.mydb: Creation complete after 4m36s [id=db-PJ5FP3WUQ4O7R5244YZ2SHHMQI][0m%0A[0m[1m[32m%0AApply complete! Resources: 14 added, 0 changed, 0 destroyed.%0A[0m[0m[1m[32m%0AOutputs:%0A%0A[0mec2_public_ip = "34.207.130.138"%0Ards_endpoint = "terraform-20251029160941414900000002.cql66w04espj.us-east-1.rds.amazonaws.com:3306"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>

<!-- Sticky Pull Request Comment🚀 Terraform Apply Output -->